from pydantic import BaseModel


class DefaultMessages(BaseModel):
    """Стандартные сообщения ответов пользователю."""

    # Общие сообщения бота
    START_BOT_MESSAGE: str = "🌍 Главное меню бота"
    MENU_CANCEL_MESSAGE: str = "⏳ Нажмите Отмена чтобы выйти в главное меню бота"
    OPTIONS_BOT_MESSAGE: str = "🚦 Доступные варианты"
    CANCEL_MESSAGE: str = "❌ Отменены все действия"
    NOT_PHOTO_MESSAGE: str = (
        "⚠ Изображение должно быть в формате .jpg, "
        ".jpeg или .png. Скидывайте изображения снова"
    )

    # Сообщения при сетевых ошибках
    NETWORK_ERROR: str = "🚫 Ошибка сети. Попробуйте позже."
    UNKNOWN_STATUS_ERROR: str = "🚫 Сайт вернул неожиданный ответ."
    SERVER_ERROR: str = "⚙️ Внутренняя ошибка сервера."
    TIMEOUT_ERROR: str = "⌛ Сервер не ответил вовремя."

    # Сообщения при обработках запроса пользователя
    TRY_REPSONSE_MESSAGE: str = "👣 Попробуйте, снова, сделать запрос..."
    WAIT_LONG_RESPONSE_MESSAGE: str = (
        "⏳ Обработка запроса может занять"
        " от {start} секунд до {end} минут. Пожалуйста, наберитесь терпения"
    )
    WAIT_MESSAGE: str = "⏳ Идет обработка запроса..."
    WAIT_AND_CANCEL_MESSAGE: str = (
        "⏳ Идет обработка запроса...Дождитесь" " обработки или нажмите Отмена"
    )

    BUTTON_CANCEL_MESSAGE: str = (
        "❌ Запрос отменен\n🚛" " Идет остановка процесса.Пожалуйста ожидайте..."
    )

    RESPONSE_WAIT_MESSAGE: str = (
        "👩‍💻 Обработка запроса:\n\n" "📥Идет обработка запроса - Ожидайте {percent} %"
    )  # Сообщение пользователю когда идет генерация видео
    END_RESPONSE_MESSAGE: str = "👩‍🔬 Обработка запроса:\n\n✅ Запрос успешно обработан"
